#include <iostream>
using namespace std;


//! second solution optemize by subtraction stansart
/*عندك 4 عناصر في اول  صف العنصر الاول بيرمز لعدد السعرات للعمود الاول والرقم التاني لعدد السعرات في العمود التاني وهكذا
والصف التاني بقولك هو داس علي انهي عمود والمطلوب تعرف عدد السعرات الكلي

//*ليها طريقتين 
الاولي: تسجل الاربع عناصر في اراي بدايه من اندكس صفر لحد اندكس 3
بعدين تروح تلوب علي كل عنصر من النص هيبقي احتمال من الاربعه (1 , 2 ,3 ,4)
لو 1 اطبع ال في اندكس 0 لو 2 اطبع ال في اندكس 1 وهكذا بس كده 
بس لاحظ مهم جدا لما بتقارن انت بتقارن ك حرف مش ك رقم 

التانية: بفكرة التحويل بالطرح انك تمسك الحرف تحوله ل ارقام وتجمع ال الاندكس علي طول 
مهو لو حرف '1' بالطرح من الحرف '0' يتحول لصحيح 1 
لو حرف '2' بالطرج يتحول لصحيح 2
خلاص روح ضيف في الاندكس علي طول بس لو 1 عايز اضيف في اندكس 0 مش 1
خلاص سهلة لما تطرح بدل متطرح من' 0' اطرح من '1' ده هيقلل 1 
فتبقي لو حرف '1' بالطرج بقا '1' فيحط مباشر في اندكس 0 وبس كده
وتروح جامع الاندكس ده بتاع الاراي ذات نفسه
*/


int main()
{
/*
    int arr[4];
    for (int i = 0; i < 4; i++)
    {
        cin >> arr[i];
    }

    string s;
    cin >> s;

    int sum = 0;

    for (int i = 0; i < s.length(); i++)
    {
        switch (s[i])
        {
        case '1':
            sum += arr[0];
            break;
        case '2':
            sum += arr[1];
            break;
        case '3':
            sum += arr[2];
            break;
        case '4':
            sum += arr[3];
        }

       
    }

    cout << sum;
*/


int arr[4];
for(int i=0;i<4;i++){
cin>>arr[i];
}

string s; 
cin>>s;

int sum=0;
for(int i=0;i<s.length();i++){

  int idx= s[i]-'1';
  sum+=arr[idx];
}


cout<<sum;


    return 0;
}





