#include <iostream>
#include <vector>
using namespace std;



/*
//*السؤال
?بيقولك كل فريق بيكون عنده لبسين مختلفين عن بعض اللبس الاول بيلبسه لما يكون بيلعب في ملعبه والتاني لما يروح كضيف لنادي تاني
?الاستثناء الوحيد للحاله دي لما يكون جاي ليا فريق كضيف لابس نفس لون لبسي ال بلعب بيه في ملعبي فانا ال اغير لبسي للبس التاني
?لان هو خلاص جايلي في الطريق بقا فمش هيغير لبسه 
?ومديك معلومة ان كل فريق هيلاعب كل الفرق يعني الاول هيلاعب التاني والتالت التاني هيلاعب الاول والتالت وكده يعني
?يهكون عدد المباريات ال هتتلعب كلها n*(n-1)
?والمطلوب ان اعرف  كام ماتش هيحصل فيه الاستثناء ده

//*الحل
?انا عايز اقارن اللبس التاني بتاع الفريق ال بكل الناس ال هتجيله يعني هقارن اللبس التاني للقريف الاول بكل اللبس الاول لكل الفرق
?هعمل مصفوفتين الاولي فيها اللبس الاول بتاع كل فريق والتانيه فيها اللبس التاني بتاع كل فريق
?وامسك اللبس التاني للفريق الاول اقارنه باللبس الاول لكل الفرق لو متساوي يبقي زود ال عداد 
?بس كده
?ملجوظة هو بيقول ان ضامنلك ان اللبسين لكل فريق مختلفين فانت فانت وانت بتقارن
?مثلا اللبس التاني للاول بتقارن باللبس الاول للاول بردو ثم للتاني وهكذا
?يعني بتقارن اللبس التاني بالاول لنفس الفريق فهنا مش هيعمل مشكلة عشان هو ضامنلك انه مختلف
?بس لو حابب بردو تهندل الحته دي يبقي تحط شرط لو الفريق هو هو الفريق اتخطي بكونتينيو


*/




int main()
{
    int n;
    cin >> n;
    vector<int> A;
    vector<int> B;
    for (int i = 0; i < n; i++)
    {
        int x;
        cin >> x;
        A.push_back(x);
        cin >> x;
        B.push_back(x);
    }

    int count = 0;
    for (int i = 0; i < n; i++)
    {

        for (int j = 0; j < n; j++)
        {
            if (i == j)
            {
                continue;
            }
            else
            {
                if (B[i] == A[j])
                {
                    count++;
                }
            }
        }
    }
    cout << count;
    return 0;
}