    #include <iostream>
    #include <string>
    #include <cctype>
    using namespace std;


 /*
 
*هناك في الكود بتاعه ان عمله بال فريكوانسي اراي كان بيفترض نوع واحد بس للحروف
*لاما كابتل لاما سمول
*فعشان يحول مثلا كالمعتاد السمول لاراقام تبدا من 0 واستخدمها ك اندكس 
*الاسمول زي مانت عارف في الاسكي اول حرف بيبدا من 97 لحد 122 فكان بيمسك كل رقم يطرح منه 97  ال هو 'ايه' فبتكون 0 1 2
*طيب هما من 97 لحد 122 بيكونو 26 حرف فبيكون من 0 لحد 25
*وبكده هو حول تحديدا الاسمول فقط من 0 لحد 25 واستخدم ك اندكس 
*
*طيب يقول لو افرضض مثلا الاسترنج كان فيه كابتل  واسمول 
*والله علي حسب انت هتعتبرهم اي 
*يعني لو هتعتبر ان الكابتل هو هو الاسمول فانا لازم الاول اعمل شرط واحول منه اي حرف كابتل لاسمول واشتغل بقا عادي بس في الطباعة هيبقي كله اسمول 
*وده في حد ذاته مش حل كويس وفي نفس الوقت ازاي مصيبة لو قالك الكابتل مختلف عن الاسمول
*فهنا بقا ناس قالت خلاص بما ان ال فريكونسي اراي بتعمل اندكس لحد اكبر فاليو والكابتل من 65 لحد 90 والاسمول من 97 لخد 122
*فحنا نعمل 122 اندكس ونششتغل بقا علي كله
*وليييييي كل ده يعم منشغل دماغنا
*
*احنا لما عملنا الاراي الاولي العاديه قولنا الاسمول من 97 لحد 122 الفرق بينهم 25 وزد 1 يبقي كل الارقام 26
*يعني من 0 لحد 25
* وبدنا نشوف ازاي نحول ال حرف ال هو ايه اسمول لل 0 وقولنا خلاص هو عباره عن 97 فنطرح كله من 97 فيدينا 0 ثم 98 تبقي 1 وهكذا بقا
*
* خلاص يباشا نعمل علي القد بالظبط نخلي الحروف الكابتل الاول عشان هي الاقل ثم الاسمول
*الكابتل هو ال ياخد من 0 لحد 25 يعني نطرج كل  حرف من 65 او حرف الايه كابتل وبكده هيبقي من 0 لحد 25
*نيجي بقا علي الاسمول نخليه يبدا من 26 ويكون بردو 26 توتل بالظبط
*احنا بنحسب الحوار ده ازاي اصلا بنحسب عدد كل الارقام
*بنطرح اخر رقم من اول رقم ونزود 1
*ولو هتعمل اندكس بتبدا من 0 وتقلل من توتل الرقم 1
*فاحنا عايزين توتل الارقام 26 ونبدا من 26
*خلاص شوف اي الرقم ال لما نطرح منه 26 ونزود واحد يديك 26 بالظبط
*هتلاقي الرقم ده هو 51
*يبقي ده اعلي اندكس عندي
* يبقي كده الااراي هتبقي من 0 لحد 51 يعني توتل هعمل اراي حجمها 52 
*وابدا اعمل شيك لو كابتل اطرح منه ال ايه كابتل فهيظبط كل ده من 0 لحد 25
*طيب لو اسمول بقا عايزين لما نطرح يدي 26 لاول حرف 
*اول حرف 97 نشيل منه كام يديني 26 هتلاقي 71 
*يبقي نشيل من كل رقم 71 
* وبس كده يمعلم
*
*
*ونعمل شيك للامان في الاول ان هو حروف بس
*وبردو افرض الكلمه كان فيها مسافه فناخد ب جيت لاين
*طيب وكده المسافه هتتعد يذكي محنا عملنا شيك الامان لو مش حرف هيعمل اسكيب
*
*
*

*
 
 */




    int main()
    {
    string s;
    getline(cin,s);


     
        int freq[52]={0};

    for(int i=0;i<s.length();i++){

        if( ! isalpha(s[i])){
            continue;
        }


        if(isupper( s[i] ) ){
            freq[s[i]-'A']++;
        }else{
            freq[s[i]-71]++;
        }

    }

        for(int i=0;i<52;i++){
            if(freq[i]>0){
                if(i>=0 && i<=25){
                    cout<< (char)(i+65)<<" : "<<freq[i]<<"\n";
                }else{
                    cout<< (char)(i+71)<<" : " <<freq[i]<<"\n";
                }
            }
        }

        return 0;
    }