#include <iostream>
using namespace std;

/*
*السؤال
?الراجل عايز يشتري جاروف ومعاه نوعين من الفلوس الاول 10 ومعاه منه كتير والتاني هي واحده عملة واحده فقط بسعر بين ال 1 و9
?هو هيديك سعر الجاروف الواحد وسعر العملة الواحد بس الفكه دي
*المطلوب
?ان الراجل يشتري اقل عدد جورايف من غير ميتبقي اي باقي خالص ويكون بالظبط
?يعني اما يدفع عشرات بس او عشرات + العملة الواحد دي وبس

*الحل
?والله هنشوف سعر الجاروف الواحد كام
?ونشوف الباقي بتاعة من ال 10 يعني هنشوف لو دفعنا عشرات كتير هيتبقي قد اي اقل من ال 10
?لو 0 يبقي متباقش حاجه وهيدفع عشرات بس
?لو مكنش 0 بس كان هو رقم قد العملة الوحيده الفكة فقط خلاص هيدفهعا ونبقي خلصنا
?غير كده يروح يجيب جروف زياده يعني يضرب في 2 ثم 3 ثم 4 وهكذا لحد ميوصل لحاجه من الاتنين اما الباقي 0 او قد العمله الفكه وبس


*/


int main()
{
    int k;
    int r;
    cin >> k >> r;

    int count = 1;

    int Current_Price = k;

    for (int i = 2; ; i++)
    {
        if (Current_Price % 10 == r || Current_Price % 10 == 0){
            break;
        }else{
            Current_Price = k*i;
            count++;
        }
    }
    cout << count;
    return 0;
}