#include <iostream>
#include <string>


/*
? فكرة السؤال
*هو بيقولك هيديك عدد السلوك بس هيبدا العد من 1 مش من 0
*بعدين هيقولك عدد الطيور علي كل سلك
*
*بعدين هيديك رقم ده عدد الطيور ال اتضربت او عدد ال ضربات ال ضربها هي هي 
*بعدها علي نفس عدد الضربات فكل ضربه هيقولك رقم السلك ال طبعا بيبدا من 1 ويديك رقم العصفوره ال اتضربت
*
*والمطلوب بيقولك كل لما يضرب طير ال علي شماله هيطير للسلك ال فوقه وال علي يمينه يطير للسلك ال تحته
*وبكده السلك ال انت ضربت عليه كل العاصفر اتصفرت واحد قتلته والشمال طلع فوق واليمين نزل تحت
*عدا حالتين لو كان ده اول سلك فبديهي مفيش سلوك فوقو خلاص ال شمال هيطير خالص واليمين ينزل للسلك ال تحت
*و لو كان اخر سلك خالص فمفيش تحت ف ال يمين هيطير خالص وال شمال هيطلع للفوق
*
*والمطلوب في النهاية خالص تقولو بقا في كل سلك من السلوك بقي معاك كام طائر
*
*
?فاحنا نقدر نحلها بحلين حل يهندل كل الكيسس وحل استغلال نقطة انه هيبدا من الواحد
!الحل الاول
*هاخد منه عادي عدد السلوك وبعدين اعمل اراي واحده بنفس عدد السلوك احط فيها عدد الطيور لكل سلك
* اكيد مش هعمل لكل سلك مصفوفه هو في الاخر اصلاا طالب العدد النهائي للطيور علي كل السولك بالتريتيب من اول سلك للاخر
*
*وبعدين اخد منه عدد الطلقات 
*بنفس عدد الطلقات هعمل لوب 
*في كل لفه اخد منه رقمين رقم ال سلك ال ضرب عليه ورقم الطير ال مات 
*اروح عامل حركه صايعه بقا عشان اهندل نقطه الاندكس هو مديني رقم السلوك بالواحد 
*فاول رقم بتاع عدد السلوك هروح مقلل منه واحد فبقي معايا بالاندكس 0 كده
*
*بعدين احسب بقا عدد الطيور ال علي الشمال ودي هقول رقم الطير ال اتضرب ناقص ال 1
*واجيب عدد ال طيور علي اليمين اقولو العدد الكلي للطير ال موجود اصلا في الاراي ال بنفس رقم السلك ناقص رقم ال طير 
*واروح مصفر خالص السلك ال ضرب عليه
*اروح اهندل الكيسس بقا
*الاولي لو كان اكس ب 0 يبقي ده اول سلك فازود علي الاندكس ال تحت ال هو 1 عدد الطيور ال في اليمين
*التانيه لو كان اكس ب اخر سلك خالص ورقم اخر سلك هو رقم السايز بتاع السلوك ناقص 1 فازود الشمال بس علي ال فوقه 
*التالت  ولا ده ولا ده يعني في النص 
*فازود بقا علي ال فوقو ال في اشمال وال تحته ال في اليمين
*
*
!الحل التاني
* اتسغل فكره انه هيبدا من 1
*وتروح مزود سايز ال سلوك 1 كمان فبقا معاك مكانين زياده مكان رقم 1 واخر مكان خالص
*مثلا لو مديك سلوك 1 2 3
*فبقا معاك 0 1 2 3 4
*وبس كده وتثبت بقا الاضافه بدل متهندل كل كيس 
*في كل الاحوال تاخد ال في اشمال فوق واليمين تحت وتصفر ال هو ضرب عليه
*وفي الاخر لما تطبع تطبع من اول ال 1 لحد 3
*

*/




using namespace std;

int main()
{
    int n_wires;
    cin >> n_wires;

    int arr[n_wires];
    for (int i = 0; i < n_wires; i++)
    {
        cin >> arr[i];
    }

    int n_shots;
    cin >> n_shots;
    for (int i = 0; i < n_shots; i++)
    {
        int x, y;
        cin >> x >> y;
        x--;
        int left = y - 1;
        int right = arr[x] - y;
        arr[x] = 0;

        if (x == 0)
        {
            arr[x + 1] += right;
        }
        else if (x == n_wires - 1)
        {
            arr[x - 1] += left;
        }
        else
        {
            arr[x - 1] += left;
            arr[x + 1] += right;
        }
    }
for(int i=0;i<n_wires;i++)
{    cout<<arr[i]<<endl;}
    return 0;
}